/**
 * 特定コードに紐付かないTODO書いておく場所
 */

// 優先度高：必須作業
// TODO: ほんちゃんリポジトリ作ってデプロイ
// 優先度中：可能ならば
// TODO: jestでテスト時に、 `window.scrollTo not implemented` なエラーが出るのの解消
// TODO: トップページに簡単な説明だけ入れておく
// TODO: サーバーサイドバリデーションエラーの日本語化
// TODO: レイアウトのコンポーネント化に関して考えたい
// TODO: レシピ作成・編集時の検索画面、URLパラメーターで操作するようにしたい
// TODO: レシピの栄養常に表示させたいなっていう話
// TODO: 食材の詳細表示を、AmountInputに設定した値で表示するように
// TODO: プライベートウィンドウで開かれた際に動作しない警告を出したほうが良い
// TODO: メモイズの徹底
// TODO: My食材の実装
// TODO: レシピ編集画面の栄養摂取目安のタブ、保存されるようにする
// TODO: hooksとResult型って相性悪い？っていう話
//  状況によってあったりなかったりするプロパティはmemoize出来ないのでは？だから相性悪いのでは？
//  => まるごとmemoizeすればmemoize出来ると判断。ただなんか気になるのでまた再考
