/**
 * 特定コードに紐付かないTODO書いておく場所
 */

/**
 * TODO: 検索結果画面で数値入力欄に全角数字を入れて、Blur時に半角数字に変換されたのを確認後、
 *  適当なモーダルを開く。そうすると入力した数字が全角に戻る不具合の修正
 *  => 制御コンポーネント、非制御コンポーネントそれぞれに対応出来る入力制御方法を考える必要がある
 *     （いっそ、制御コンポーネントと非制御コンポーネントでコンポーネント自体を分けるのも可）
 */
// TODO: 食材増やしたい
// TODO: jestでテスト時に、 `window.scrollTo not implemented` なエラーが出るのの解消
// TODO: トップページに簡単な説明だけ入れておく
// TODO: サーバーサイドバリデーションエラーの日本語化
// TODO: レイアウトのコンポーネント化に関して考えたい
// TODO: レシピ作成・編集時の検索画面、URLパラメーターで操作するようにしたい
// TODO: レシピの栄養常に表示させたいなっていう話
// TODO: 食材の詳細表示を、AmountInputに設定した値で表示するように
// TODO: プライベートウィンドウで開かれた際に動作しない警告を出したほうが良い
// TODO: メモイズの徹底
// TODO: My食材の実装
// TODO: レシピ編集画面の栄養摂取目安のタブ、保存されるようにする
//  状況によってあったりなかったりするプロパティはmemoize出来ないのでは？だから相性悪いのでは？
//  => まるごとmemoizeすればmemoize出来ると判断。ただなんか気になるのでまた再考
